Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
#include "mqtt_client.h"
#include "config.h"
#include "wifi_manager.h"
#include "gpio_control.h"
#include "timer_engine.h"
#include "logic_engine.h"
#include "i2c_engine.h"
#include "onewire_engine.h"
#include "rtc_engine.h"
#include "rand_engine.h"
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>
#include <Update.h>
#include <ESP32Servo.h>
#include "script_engine.h"
#include "pin_caps.h"
#include "uart_engine.h"
#include "spi_engine.h"
#include "touch_engine.h"
#include "data_engine.h"
#include "msg_dedup.h"
#include "dual_channel.h"
#include "encoder_engine.h"







static WiFiClient wifiClient;
static WiFiClientSecure sslClient;
static PubSubClient mqttClient(wifiClient);

// ===== WS 结果转发 =====
typedef void (*WsSendFunc)(uint8_t, const char *);
static WsSendFunc _wsSend = nullptr;
static uint8_t _wsClient = 0xFF;

void setResultSink(uint8_t clientNum, WsSendFunc fn) {
  _wsClient = clientNum;
  _wsSend = fn;
}

static void publishResult(const String &payload) {
  if (mqttClient.connected() && config.pubTopics.size() > 0)
    mqttClient.publish(config.pubTopics[0].topic.c_str(), payload.c_str());
  if (_wsClient != 0xFF && _wsSend)
    _wsSend(_wsClient, payload.c_str());
}

bool MqttClient::publish(const String &json) {
  if (!mqttClient.connected()) return false;

  // ═══════════════════════════════════════════════════════════
  // ★★★ 新增：注入 _from 字段，让接收方能识别消息来源 ★★★
  // ═══════════════════════════════════════════════════════════
  String finalJson = json;
  {
    JsonDocument doc;
    if (!deserializeJson(doc, json)) {
      doc["_from"] = getDeviceId();
      serializeJson(doc, finalJson);
    }
  }
  // ═══════════════════════════════════════════════════════════
  // ★★★ 新增结束 ★★★
  // ═══════════════════════════════════════════════════════════

  bool anyOk = false;
  // 发到 subTopics（所有设备都订阅的共享命令通道）
  for (size_t i = 0; i < config.subTopics.size(); i++) {
    if (mqttClient.publish(config.subTopics[i].topic.c_str(), finalJson.c_str()))
      anyOk = true;
  }
  return anyOk;
}





static bool connected = false;
static bool sslPreConnected = false;



// 非阻塞重连状态机
enum MqttState { MQTT_IDLE,
                 MQTT_RESOLVING,
                 MQTT_CONNECTING,
                 MQTT_LINKED };
static MqttState mqttState = MQTT_IDLE;
static unsigned long mqttStateTime = 0;
static unsigned long mqttReconnectBackoff = 2000;
static const unsigned long MQTT_MAX_BACKOFF = 30000;
static IPAddress resolvedIP;
static String pendingClientId;

// MQTT OTA
static bool mqttOtaActive = false;
static size_t otaTotalSize = 0;
static size_t otaChunks = 0;
static uint32_t otaChunkCount = 0;
static size_t otaWritten = 0;
static unsigned long otaLastChunk = 0;



// PubSubClient 错误码转字符串
static const char *mqttErrorString(int rc) {
  switch (rc) {
    case -4: return "CONNECTION_TIMEOUT";
    case -3: return "CONNECTION_LOST";
    case -2: return "CONNECT_FAILED";
    case -1: return "DISCONNECTED";
    case 0: return "CONNECTED";
    case 1: return "BAD_PROTOCOL";
    case 2: return "BAD_CLIENT_ID";
    case 3: return "UNAVAILABLE";
    case 4: return "BAD_CREDENTIALS";
    case 5: return "UNAUTHORIZED";
    default: return "UNKNOWN";
  }
}

// 舵机
#define MAX_SERVOS 8
struct ServoEntry {
  Servo servo;
  int pin;
  int angle;
  bool attached;
};
static ServoEntry servoList[MAX_SERVOS];
static int servoCount = 0;

static ServoEntry *findOrAddServo(int pin) {
  for (int i = 0; i < servoCount; i++) {
    if (servoList[i].pin == pin) return &servoList[i];
  }
  if (servoCount < MAX_SERVOS) {
    ServoEntry &se = servoList[servoCount];
    se.pin = pin;
    se.angle = 0;
    se.attached = false;
    servoCount++;
    return &se;
  }
  return nullptr;
}


// 批量上报
static unsigned long lastBatchReport = 0;
static const char *LWT_TOPIC = "esp32/status";
static const char *LWT_ONLINE = "{\"online\":true}";
static const char *LWT_OFFLINE = "{\"online\":false}";

static void publishBatchStatus() {
  if (!mqttClient.connected() || config.pubTopics.size() == 0) return;

  JsonDocument doc;
  doc["type"] = "batch_status";
  doc["deviceId"] = getDeviceId();
  doc["mac"] = WiFi.macAddress();  //设备序列号
  doc["timestamp"] = millis();
  doc["heapFree"] = ESP.getFreeHeap();
  doc["uptime"] = millis() / 1000;
  doc["otaVerify"] = OTA_VERIFY_TAG;  // 新增

  JsonArray snrs = doc["sensors"].to<JsonArray>();
  for (auto &s : config.sensors) {
    if (!s.enabled) continue;
    JsonObject o = snrs.add<JsonObject>();
    o["pin"] = s.pin;
    o["label"] = s.label;
    o["raw"] = analogRead(s.pin);
  }

  JsonArray ins = doc["inputs"].to<JsonArray>();
  for (auto &t : config.inputs) {
    if (!t.enabled) continue;
    JsonObject o = ins.add<JsonObject>();
    o["pin"] = t.pin;
    o["label"] = t.label;
    o["value"] = digitalRead(t.pin);
  }

  String payload;
  serializeJson(doc, payload);
  publishResult(payload);
  Serial.println("[BATCH] Status published");
}

// 串口缓冲
static String serialBuffer = "";
static MsgDedup cmdDedup;

// 前向声明
static void handleCommand(JsonDocument &doc, bool fromMqtt = false);

static void handleSensorCommand(JsonDocument &doc);
static void handleInputCommand(JsonDocument &doc);
static void handleTimerCommand(JsonDocument &doc);
static void handleLogicCommand(JsonDocument &doc);

static void executeCommandImpl(JsonDocument &doc) {
  handleCommand(doc);
}

void executeCommand(JsonDocument &doc) __attribute__((weak));
void executeCommand(JsonDocument &doc) {
  executeCommandImpl(doc);
}

// 传感器指令处理
static void handleSensorCommand(JsonDocument &doc) {
  String action = doc["action"].as<String>();

  if (action == "add") {
    SensorTask s;
    s.pin = doc["pin"] | -1;
    s.interval = doc["interval"] | 5000;
    s.type = doc["type"] | 0;
    s.enabled = true;
    s.label = doc["label"].as<String>();
    bool persist = doc["persistent"] | false;  // 新增

    if (s.pin >= 0 && !isValidExternalPin(s.pin)) {
      Serial.printf("[SENSOR] REJECTED: pin=%d not in external pinout\n", s.pin);
      return;
    }

    s.interval = doc["interval"] | 5000;

    if (s.pin >= 0 && config.sensors.size() < MAX_SENSORS) {
      config.sensors.push_back(s);
      config.sensors.back().persistent = persist;

