Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
      if (persist) {
        config.save();
        Serial.printf("[SENSOR] Added pin=%d interval=%d type=%d label=%s (persistent)\n",
                      s.pin, s.interval, s.type, s.label.c_str());
      } else {
        Serial.printf("[SENSOR] Added pin=%d interval=%d type=%d label=%s (non-persistent)\n",
                      s.pin, s.interval, s.type, s.label.c_str());
      }
    }

  } else if (action == "remove") {
    int pin = doc["pin"] | -1;
    for (auto it = config.sensors.begin(); it != config.sensors.end(); ++it) {
      if (it->pin == pin) {
        bool wasPersistent = it->persistent;
        config.sensors.erase(it);
        if (wasPersistent) config.save();  // 只有原本持久化的才需要更新NVS
        Serial.printf("[SENSOR] Removed pin=%d\n", pin);
        break;
      }
    }

  } else if (action == "enable") {
    int pin = doc["pin"] | -1;
    bool en = doc["enabled"] | true;
    for (auto &s : config.sensors) {
      if (s.pin == pin) {
        s.enabled = en;
        if (s.persistent) config.save();  // 只有持久化的才需要更新NVS
        Serial.printf("[SENSOR] Pin %d %s\n", pin, en ? "enabled" : "disabled");
        break;
      }
    }

  } else if (action == "interval") {
    int pin = doc["pin"] | -1;
    int interval = doc["interval"] | 5000;
    for (auto &s : config.sensors) {
      if (s.pin == pin) {
        s.interval = interval;
        if (s.persistent) config.save();  // 只有持久化的才需要更新NVS
        Serial.printf("[SENSOR] Pin %d interval=%d\n", pin, interval);
        break;
      }
    }

  } else if (action == "read") {
    int pin = doc["pin"] | -1;
    if (pin >= 0) {
      int raw = analogRead(pin);
      Serial.printf("[SENSOR] Read pin=%d raw=%d\n", pin, raw);
      JsonDocument resp;
      resp["type"] = "sensor";
      resp["deviceId"] = getDeviceId();
      resp["pin"] = pin;
      resp["raw"] = raw;
      for (auto &s : config.sensors) {
        if (s.pin == pin) {
          resp["label"] = s.label;
          break;
        }
      }
      if (doc.containsKey("result_var")) {
        String varName = doc["result_var"].as<String>();
        if (varName.length() > 0)
          ScriptEngine::setVar(varName, (float)raw, false);
      }

      String p;
      serializeJson(resp, p);
      if (mqttClient.connected() && config.pubTopics.size() > 0) {
        publishResult(p);
      }
    }

  } else if (action == "list") {
    JsonDocument resp;
    resp["type"] = "sensor_list";
    resp["deviceId"] = getDeviceId();
    JsonArray arr = resp["sensors"].to<JsonArray>();
    for (auto &s : config.sensors) {
      JsonObject o = arr.add<JsonObject>();
      o["pin"] = s.pin;
      o["interval"] = s.interval;
      o["type"] = s.type;
      o["enabled"] = s.enabled;
      o["label"] = s.label;
      o["persistent"] = s.persistent;  // 新增：列表中也显示持久化状态
    }
    String p;
    serializeJson(resp, p);
    publishResult(p);
    Serial.println("[SENSOR] List published");



  } else {
    Serial.printf("[SENSOR] Unknown: %s\n", action.c_str());
  }
}


// 数字输入指令处理
static void handleInputCommand(JsonDocument &doc) {
  String action = doc["action"].as<String>();

  if (action == "add") {
    InputTask t;
    t.pin = doc["pin"] | -1;
    t.mode = doc["mode"] | INPUT_PULLUP;
    t.debounceMs = doc["debounce"] | 50;
    t.enabled = true;
    t.label = doc["label"].as<String>();
    t.lastValue = -1;
    t.lastChange = 0;
    bool persist = doc["persistent"] | false;  // 新增

    if (t.pin >= 0 && !isValidExternalPin(t.pin)) {
      Serial.printf("[INPUT] REJECTED: pin=%d not in external pinout\n", t.pin);
      return;
    }

    t.mode = doc["mode"] | INPUT_PULLUP;

    if (t.pin >= 0 && config.inputs.size() < MAX_INPUTS) {
      int cm = GpioControl::getPinMode(t.pin);
      if (cm == OUTPUT) {
        Serial.printf("[INPUT] REJECTED: pin=%d is OUTPUT\n", t.pin);
      } else {
        pinMode(t.pin, t.mode);
        t.lastValue = digitalRead(t.pin);
        t.persistent = persist;
        config.inputs.push_back(t);

        if (persist) {
          config.save();
          Serial.printf("[INPUT] Added pin=%d mode=%d lbl=%s (persistent)\n",
                        t.pin, t.mode, t.label.c_str());
        } else {
          Serial.printf("[INPUT] Added pin=%d mode=%d lbl=%s (non-persistent)\n",
                        t.pin, t.mode, t.label.c_str());
        }
      }
    }

  } else if (action == "remove") {
    int pin = doc["pin"] | -1;
    for (auto it = config.inputs.begin(); it != config.inputs.end(); ++it) {
      if (it->pin == pin) {
        bool wasPersistent = it->persistent;
        config.inputs.erase(it);
        if (wasPersistent) config.save();  // 只有原本持久化的才需要更新NVS
        Serial.printf("[INPUT] Removed pin=%d\n", pin);
        break;
      }
    }

  } else if (action == "enable") {
    int pin = doc["pin"] | -1;
    bool en = doc["enabled"] | true;
    for (auto &t : config.inputs) {
      if (t.pin == pin) {
        t.enabled = en;
        if (t.persistent) config.save();  // 只有持久化的才需要更新NVS
        Serial.printf("[INPUT] Pin %d %s\n", pin, en ? "enabled" : "disabled");
        break;
      }
    }

  } else if (action == "list") {
    JsonDocument resp;
    resp["type"] = "input_list";
    resp["deviceId"] = getDeviceId();
    JsonArray arr = resp["inputs"].to<JsonArray>();
    for (auto &t : config.inputs) {
      JsonObject o = arr.add<JsonObject>();
      o["pin"] = t.pin;
      o["mode"] = t.mode;
      o["enabled"] = t.enabled;
      o["label"] = t.label;
      o["lastValue"] = t.lastValue;
      o["persistent"] = t.persistent;  // 新增：列表中也显示持久化状态
    }
    String p;
    serializeJson(resp, p);
    publishResult(p);
    Serial.println("[INPUT] List published");



  } else {
    Serial.printf("[INPUT] Unknown: %s\n", action.c_str());
  }
}


// 定时器指令处理
static void handleTimerCommand(JsonDocument &doc) {
  String action = doc["action"].as<String>();

  if (action == "add") {
    TimerTask t;
    t.id = doc["id"].as<String>();
    t.type = doc["type"].as<String>();
    t.interval = doc["interval"] | 5000;
    t.count = doc["count"] | -1;
    t.enabled = doc["enabled"] | true;
    t.executed = 0;
    t.duration = doc["duration"] | 0;
    t.autoDelete = doc["autoDelete"] | false;
    bool persist = doc["persistent"] | false;  // ← 必须在这里声明

    if (doc.containsKey("commands")) {
      JsonDocument cmdsDoc;
      if (!deserializeJson(cmdsDoc, doc["commands"])) {
        if (cmdsDoc.is<JsonArray>()) {
          for (JsonObject c : cmdsDoc.as<JsonArray>()) {
            if (c.containsKey("pin")) {
              int p = c["pin"].as<int>();
              if (!isValidExternalPin(p)) {
                Serial.printf("[TIMER] REJECTED: pin=%d not in external pinout\n", p);
                return;
              }
            }
            if (c.containsKey("rPin")) {
              int p = c["rPin"].as<int>();
              if (!isValidExternalPin(p)) {
                Serial.printf("[TIMER] REJECTED: rPin=%d\n", p);
                return;
              }
            }
            if (c.containsKey("gPin")) {
              int p = c["gPin"].as<int>();
              if (!isValidExternalPin(p)) {
                Serial.printf("[TIMER] REJECTED: gPin=%d\n", p);
                return;
              }
            }
            if (c.containsKey("bPin")) {
              int p = c["bPin"].as<int>();
              if (!isValidExternalPin(p)) {
                Serial.printf("[TIMER] REJECTED: bPin=%d\n", p);
                return;
              }
            }
          }
        }
      }
      String cmdsStr;
      serializeJson(doc["commands"], cmdsStr);
      t.commandsJson = cmdsStr;
    } else {
      t.commandsJson = "[]";
    }

