Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
    TimerEngine::add(t);

    if (persist) {
      bool found = false;
      for (auto &te : config.timers) {
        if (te.id == t.id) {
          te.type = t.type;
          te.interval = t.interval;
          te.count = t.count;
          te.enabled = t.enabled;
          te.commandsJson = t.commandsJson;
          te.persistent = true;
          found = true;
          break;
        }
      }
      if (!found && config.timers.size() < MAX_TIMERS) {
        TimerEntry te;
        te.id = t.id;
        te.type = t.type;
        te.interval = t.interval;
        te.count = t.count;
        te.enabled = t.enabled;
        te.commandsJson = t.commandsJson;
        te.persistent = true;
        config.timers.push_back(te);
      }
      config.save();
    } else {
      Serial.printf("[TIMER] '%s' is non-persistent (not saved to NVS)\n", t.id.c_str());
    }

  } else if (action == "remove") {
    String id = doc["id"].as<String>();
    TimerEngine::remove(id);
    for (auto it = config.timers.begin(); it != config.timers.end(); ++it) {
      if (it->id == id) {
        config.timers.erase(it);
        break;
      }
    }
    config.save();

  } else if (action == "enable") {
    String id = doc["id"].as<String>();
    bool en = doc["enabled"] | true;
    TimerEngine::enable(id, en);
    for (auto &te : config.timers) {
      if (te.id == id) {
        te.enabled = en;
        break;
      }
    }
    config.save();

  } else if (action == "reset") {
    String id = doc["id"].as<String>();
    TimerEngine::reset(id);

  } else if (action == "list") {
    String json = TimerEngine::toJson();
    publishResult(json);
    Serial.println("[TIMER] List published");



  } else {
    Serial.printf("[TIMER] Unknown action: %s\n", action.c_str());
  }
}


// 逻辑规则指令处理
static void handleLogicCommand(JsonDocument &doc) {
  String action = doc["action"].as<String>();

  if (action == "add") {
    LogicRule r;
    r.id = doc["id"].as<String>();
    r.operator_ = doc["operator"] | String("and");
    r.enabled = doc["enabled"] | true;
    r.cooldown = doc["cooldown"] | 1000;
    bool persist = doc["persistent"] | false;  // 新增：默认true兼容旧用法

    if (doc.containsKey("conditions")) {
      for (JsonObject c : doc["conditions"].as<JsonArray>()) {
        SimpleCondition sc;
        sc.source = c["source"].as<String>();
        sc.pin = c["pin"] | -1;

        if (sc.pin >= 0 && !isValidExternalPin(sc.pin)) {
          Serial.printf("[LOGIC] REJECTED: condition pin=%d not in external pinout\n", sc.pin);
          return;
        }

        sc.op = c["op"].as<String>();
        sc.value = c["value"] | 0.0f;
        sc.source_var = c["name"] | String("");  // 新增
        r.conditions.push_back(sc);
      }
    }

    if (doc.containsKey("actions")) {
      // 验证 actions 中的引脚
      JsonDocument actDoc;
      if (!deserializeJson(actDoc, doc["actions"])) {
        if (actDoc.is<JsonArray>()) {
          for (JsonObject a : actDoc.as<JsonArray>()) {
            if (a.containsKey("pin")) {
              int p = a["pin"].as<int>();
              if (!isValidExternalPin(p)) {
                Serial.printf("[LOGIC] REJECTED: action pin=%d not in external pinout\n", p);
                return;
              }
            }
          }
        }
      }
      String actsStr;
      serializeJson(doc["actions"], actsStr);
      r.actionsJson = actsStr;
    } else {
      r.actionsJson = "[]";
    }

    LogicEngine::add(r);  // 运行时总是加入

    // 只有 persistent=true 才写入NVS
    if (persist) {
      bool found = false;
      for (auto &lre : config.logicRules) {
        if (lre.id == r.id) {
          lre.operator_ = r.operator_;
          lre.enabled = r.enabled;
          lre.cooldown = r.cooldown;
          lre.actionsJson = r.actionsJson;
          lre.persistent = true;
          lre.conditions.clear();
          for (auto &sc : r.conditions) {
            ConditionEntry ce;
            ce.source = sc.source;
            ce.pin = sc.pin;
            ce.op = sc.op;
            ce.value = sc.value;
            lre.conditions.push_back(ce);
          }
          found = true;
          break;
        }
      }
      if (!found && config.logicRules.size() < MAX_LOGIC_RULES) {
        LogicRuleEntry lre;
        lre.id = r.id;
        lre.operator_ = r.operator_;
        lre.enabled = r.enabled;
        lre.cooldown = r.cooldown;
        lre.actionsJson = r.actionsJson;
        lre.persistent = true;
        for (auto &sc : r.conditions) {
          ConditionEntry ce;
          ce.source = sc.source;
          ce.pin = sc.pin;
          ce.op = sc.op;
          ce.value = sc.value;
          lre.conditions.push_back(ce);
        }
        config.logicRules.push_back(lre);
      }
      config.save();
    } else {
      Serial.printf("[LOGIC] Rule '%s' is non-persistent (not saved to NVS)\n", r.id.c_str());
    }
  } else if (action == "remove") {
    String id = doc["id"].as<String>();
    LogicEngine::remove(id);
    for (auto it = config.logicRules.begin(); it != config.logicRules.end(); ++it) {
      if (it->id == id) {
        config.logicRules.erase(it);
        break;
      }
    }
    config.save();
  } else if (action == "enable") {
    String id = doc["id"].as<String>();
    bool en = doc["enabled"] | true;
    LogicEngine::enable(id, en);
    for (auto &lre : config.logicRules) {
      if (lre.id == id) {
        lre.enabled = en;
        break;
      }
    }
    config.save();
  } else if (action == "list") {
    String json = LogicEngine::toJson();
    publishResult(json);
    Serial.println("[LOGIC] List published");


  } else {
    Serial.printf("[LOGIC] Unknown action: %s\n", action.c_str());
  }
}

// 主命令分发
static void handleCommand(JsonDocument &doc, bool fromMqtt) {


  // ===== _mid 去重 =====
  {
    uint16_t mid = MsgDedup::parseMid(doc);
    if (cmdDedup.isDuplicate(mid)) {
      Serial.printf("[CMD] Dup _mid=0x%04X, skipped\n", mid);
      return;
    }
    cmdDedup.record(mid);
  }

  if (doc.containsKey("target")) {
    String t = doc["target"].as<String>();
    if (t.length() > 0 && t != "all") {
      String myId = getDeviceId();
      String myName = config.deviceName;
      bool matchId = (t == myId);
      bool matchName = (myName.length() > 0 && t == myName);
      if (!matchId && !matchName) {
        String cmdCheck = doc["cmd"].as<String>();
        if (cmdCheck == "forward") {
          // 不做任何事，让代码继续往下走到 forward 处理器
        } else {
          String json;
          serializeJson(doc, json);
          if (fromMqtt) {
            DualChannel::sendToTargetLan(t, json);
          } else {
            DualChannel::sendToTarget(t, json);
          }
          return;
        }
      }
    }
  }
  String cmd = doc["cmd"].as<String>();


