Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
  if (cmd == "set") {

    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: pin=%d not in external pinout\n", pin);
      return;
    }
    int value = 0;
    if (doc["value"].is<int>()) {
      value = doc["value"].as<int>();
    } else if (doc["value"].is<float>()) {
      value = (int)doc["value"].as<float>();
    } else if (doc["value"].is<String>()) {
      value = doc["value"].as<String>().toInt();
    }
    if (pin >= 0) {
      GpioControl::digitalSet(pin, value);
      Serial.printf("[GPIO] SET pin=%d value=%d\n", pin, value);
      GpioControl::publishStatus();
    }
  } else if (cmd == "toggle") {
    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: pin=%d not in external pinout\n", pin);
      return;
    }
    if (pin >= 0) {
      GpioControl::digitalToggle(pin);
      Serial.printf("[GPIO] TOGGLE pin=%d\n", pin);
      GpioControl::publishStatus();
    }
  } else if (cmd == "mode") {
    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: pin=%d not in external pinout\n", pin);
      return;
    }
    String modeStr = doc["mode"].as<String>();
    if (pin >= 0) {
      int m = OUTPUT;
      if (modeStr == "input") m = INPUT;
      else if (modeStr == "input_pullup") m = INPUT_PULLUP;
      GpioControl::setMode(pin, m);
      Serial.printf("[GPIO] MODE pin=%d mode=%s\n", pin, modeStr.c_str());
      GpioControl::publishStatus();
    }
  } else if (cmd == "pwm") {
    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: pin=%d not in external pinout\n", pin);
      return;
    }
    int value = 0;
    if (doc["value"].is<int>()) {
      value = doc["value"].as<int>();
    } else if (doc["value"].is<float>()) {
      value = (int)doc["value"].as<float>();
    } else if (doc["value"].is<String>()) {
      // 兼容 $V: 变量插值后变为字符串的情况
      value = doc["value"].as<String>().toInt();
    }
    if (pin >= 0) {
      GpioControl::analogSet(pin, value);
      Serial.printf("[GPIO] PWM pin=%d value=%d\n", pin, value);
      GpioControl::publishStatus();
    }
  }

  else if (cmd == "publish") {
    String topic = doc["topic"].as<String>();
    String payload;
    if (doc.containsKey("payload")) {
      if (doc["payload"].is<JsonObject>() || doc["payload"].is<JsonArray>()) {
        serializeJson(doc["payload"], payload);
      } else {
        payload = doc["payload"].as<String>();
      }
    }

    // ===== 变量插值："$V:varname" → 数字（去掉引号） =====
    {
      int pos;
      int loopGuard = 0;
      while ((pos = payload.indexOf("\"$V:")) >= 0 && loopGuard < 20) {
        loopGuard++;
        String varName = "";
        int nameStart = pos + 4;
        for (int i = nameStart; i < (int)payload.length(); i++) {
          char c = payload.charAt(i);
          if (isAlphaNumeric(c) || c == '_') varName += c;
          else break;
        }
        if (varName.length() > 0
            && nameStart + (int)varName.length() < (int)payload.length()
            && payload.charAt(nameStart + varName.length()) == '"') {
          float val = ScriptEngine::getVar(varName, 0);
          int nameEnd = nameStart + varName.length() + 1;
          payload = payload.substring(0, pos)
                    + String((int)val)
                    + payload.substring(nameEnd);
          Serial.printf("[PUBLISH] Interpolated $V:%s → %d\n", varName.c_str(), (int)val);
        } else break;
      }
    }
    // ===== 插值结束 =====
    if (payload.startsWith("{")) {
      JsonDocument payloadDoc;
      if (!deserializeJson(payloadDoc, payload)) {
        payloadDoc["_from"] = getDeviceId();
        serializeJson(payloadDoc, payload);
      }
    }

    if (topic.length() > 0 && MqttClient::isConnected()) {
      MqttClient::publish(topic.c_str(), payload.c_str());
      Serial.printf("[MQTT] Publish to %s: %s\n", topic.c_str(), payload.c_str());
    }
  }

  // ═══════════════════════════════════════════════════════════
  // ★★★ 新增：forward 命令 — 跨设备转发 ★★★
  // ═══════════════════════════════════════════════════════════
  // ═══════════════════════════════════════════════════════════
  // ★★★ forward 命令 — 跨设备转发 ★★★
  // ═══════════════════════════════════════════════════════════
  else if (cmd == "forward") {
    String target = doc["target"].as<String>();
    if (target.length() == 0) {
      Serial.println("[FWD] target required");
      return;
    }
    if (!doc.containsKey("payload")) {
      Serial.println("[FWD] payload required");
      return;
    }

    // 1. 序列化 payload 为字符串
    String payloadStr;
    serializeJson(doc["payload"], payloadStr);

    // 2. $V: 变量插值
    {
      int pos;
      int guard = 0;
      while ((pos = payloadStr.indexOf("\"$V:")) >= 0 && guard < 20) {
        guard++;
        String varName = "";
        int nameStart = pos + 4;
        for (int i = nameStart; i < (int)payloadStr.length(); i++) {
          char c = payloadStr.charAt(i);
          if (isAlphaNumeric(c) || c == '_') varName += c;
          else break;
        }
        if (varName.length() > 0
            && nameStart + (int)varName.length() < (int)payloadStr.length()
            && payloadStr.charAt(nameStart + varName.length()) == '"') {
          float val = ScriptEngine::getVar(varName, 0);
          int nameEnd = nameStart + varName.length() + 1;
          payloadStr = payloadStr.substring(0, pos)
                       + String((int)val)
                       + payloadStr.substring(nameEnd);
          Serial.printf("[FWD] $V:%s → %d\n", varName.c_str(), (int)val);
        } else break;
      }
    }

    // 3. 判断 target 是否是自己
    String myId = getDeviceId();
    String myName = config.deviceName;
    bool isSelf = (target == myId) || (myName.length() > 0 && target == myName);

    if (isSelf) {
      // ★★★ target 是自己，直接本地执行 payload ★★★
      JsonDocument payloadDoc;
      if (!deserializeJson(payloadDoc, payloadStr)) {
        Serial.printf("[FWD] Local exec: %s\n", payloadStr.c_str());
        executeCommand(payloadDoc);
      }
    } else {
      // ★★★ target 是其他设备，注入 target 和 _from，通过 DualChannel 发送 ★★★
      JsonDocument payloadDoc;
      if (!deserializeJson(payloadDoc, payloadStr)) {
        payloadDoc["target"] = target;
        payloadDoc["_from"] = getDeviceId();
        serializeJson(payloadDoc, payloadStr);
      }
      bool ok = DualChannel::sendToTarget(target, payloadStr);
      Serial.printf("[FWD] → %s (%s): %s\n",
                    target.c_str(), ok ? "OK" : "FAIL", payloadStr.c_str());
    }
  }
  // ═══════════════════════════════════════════════════════════
  // ★★★ forward 结束 ★★★
  // ═══════════════════════════════════════════════════════════


  else if (cmd == "rgb") {
    int rPin = doc["rPin"] | -1;
    int gPin = doc["gPin"] | -1;
    int bPin = doc["bPin"] | -1;
    if ((rPin >= 0 && !isValidExternalPin(rPin)) || (gPin >= 0 && !isValidExternalPin(gPin)) || (bPin >= 0 && !isValidExternalPin(bPin))) {
      Serial.println("[GPIO] RGB: invalid pin in external pinout");
      return;
    }
    int r = doc["r"] | 0;
    int g = doc["g"] | 0;
    int b = doc["b"] | 0;
    if (rPin >= 0 && gPin >= 0 && bPin >= 0) {
      GpioControl::analogSet(rPin, r);
      GpioControl::analogSet(gPin, g);
      GpioControl::analogSet(bPin, b);
      Serial.printf("[GPIO] RGB R=%d(pin%d) G=%d(pin%d) B=%d(pin%d)\n",
                    r, rPin, g, gPin, b, bPin);
      GpioControl::publishStatus();
    } else {
      Serial.println("[GPIO] RGB: rPin/gPin/bPin all required");
    }
  } else if (cmd == "servo") {
    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: pin=%d not in external pinout\n", pin);
      return;
    }
    int angle = doc["angle"] | 90;
    if (pin >= 0) {
      ServoEntry *se = findOrAddServo(pin);
      if (se) {
        if (!se->attached) {
          se->servo.attach(pin);
          se->attached = true;
          Serial.printf("[GPIO] SERVO attached pin=%d\n", pin);
        }
        se->servo.write(angle);
        se->angle = angle;
        Serial.printf("[GPIO] SERVO pin=%d angle=%d\n", pin, angle);
      }
    } else {
      Serial.println("[GPIO] SERVO: pin required");
    }
  } else if (cmd == "servo_detach") {
    int pin = doc["pin"] | -1;
    if (pin >= 0 && !isValidExternalPin(pin)) {
      Serial.printf("[GPIO] REJECTED: servo_detach pin=%d\n", pin);
      return;
    }
    if (pin >= 0) {
      bool found = false;
      for (int i = 0; i < servoCount; i++) {
        if (servoList[i].pin == pin) {
          if (servoList[i].attached) {
            servoList[i].servo.detach();
            servoList[i].attached = false;
          }
          found = true;
          break;
        }
      }
      // ★ 不管 servoList 里有没有，都强制释放 LEDC 通道
      ledcDetach(pin);
      pinMode(pin, OUTPUT);
      digitalWrite(pin, LOW);
      Serial.printf("[GPIO] SERVO_DETACH pin=%d (found=%s)\n",
                    pin, found ? "yes" : "no");
    }
  }


  else if (cmd == "pulse_in") {
    int pin = doc["pin"] | -1;
    if (pin < 0 || !isValidExternalPin(pin)) {
      Serial.println("[PULSE] REJECTED: invalid pin");
      return;
    }
    int trigPin = doc["trig"] | -1;
    if (trigPin >= 0 && !isValidExternalPin(trigPin)) {
      Serial.printf("[PULSE] REJECTED: trig=%d\n", trigPin);
      return;
    }
    String state = doc["state"] | String("high");
    int timeout = doc["timeout"] | 30000;
    int samples = doc["samples"] | 1;
    if (samples < 1) samples = 1;
    if (samples > 20) samples = 20;

    int level = (state == "low") ? LOW : HIGH;
    long medianDuration = GpioControl::measurePulse(pin, trigPin, level, timeout, samples);

    if (doc.containsKey("result_var")) {
      String varName = doc["result_var"].as<String>();
      if (varName.length() > 0)
        ScriptEngine::setVar(varName, (float)medianDuration, false);
    }

    JsonDocument resp;
    resp["type"] = "pulse_in";
    resp["deviceId"] = getDeviceId();
    resp["pin"] = pin;
    resp["state"] = state;
    resp["duration"] = medianDuration;
    resp["samples"] = samples;
    String p;
    serializeJson(resp, p);
    if (MqttClient::isConnected() && config.pubTopics.size() > 0)
      MqttClient::publish(config.pubTopics[0].topic.c_str(), p.c_str());
    Serial.printf("[PULSE] pin=%d state=%s duration=%ld us (%d samples)\n",
                  pin, state.c_str(), medianDuration, samples);
  }

  // ★ 新增：音频输出
  else if (cmd == "tone") {
    int pin = doc["pin"] | -1;
    if (pin < 0 || !isValidExternalPin(pin)) {
      Serial.printf("[TONE] REJECTED: pin=%d\n", pin);
      return;
    }
    unsigned int freq = doc["freq"] | 0;
    GpioControl::toneSet(pin, freq);
    Serial.printf("[TONE] pin=%d freq=%u\n", pin, freq);
  }




  else if (cmd == "batch") {
    int batchDepth = 0;
    if (doc.containsKey("_bd")) batchDepth = doc["_bd"].as<int>();
    if (batchDepth >= 3) {
      Serial.println("[BATCH] Max depth 3 reached, skipped");
      return;
    }
    JsonArray cmds = doc["commands"].as<JsonArray>();
    Serial.printf("[GPIO] BATCH: %u commands (depth=%d)\n", cmds.size(), batchDepth);
    for (JsonObject c : cmds) {
      JsonDocument tmp;
      tmp.set(c);
      tmp["_bd"] = batchDepth + 1;
      handleCommand(tmp, fromMqtt);
    }
  }


  else if (cmd == "clear") {
    Serial.println("[GPIO] Clearing all pins");

    // 1. 保存定时器原始状态，然后禁用
    std::vector<bool> timerStates;
    for (auto &t : TimerEngine::getList()) {
      timerStates.push_back(t.enabled);
      t.enabled = false;
    }

    // 2. 保存逻辑规则原始状态，然后禁用
    std::vector<bool> logicStates;
    for (auto &r : LogicEngine::getList()) {
      logicStates.push_back(r.enabled);
      r.enabled = false;
    }

    // 3. 清除所有引脚
    for (int pin = 0; pin < 48; pin++) {
      int mode = GpioControl::getPinMode(pin);
      if (mode == OUTPUT) {
        analogWrite(pin, 0);
        digitalWrite(pin, LOW);
        Serial.printf("[GPIO] Cleared pin %d\n", pin);
      }
    }

    // 4. 分离所有舵机
    for (int i = 0; i < servoCount; i++) {
      if (servoList[i].attached) {
        servoList[i].servo.detach();
        servoList[i].attached = false;
        Serial.printf("[GPIO] Detached servo pin %d\n", servoList[i].pin);
      }
    }

    // 5. 重置 GPIO 运行时记录
    GpioControl::init();

    // 6. 原样恢复定时器状态（不改 RTC 相关的触发时间）
    for (size_t i = 0; i < TimerEngine::getList().size(); i++) {
      auto &t = TimerEngine::getList()[i];
      t.enabled = timerStates[i];
      // 如果原来是启用的，重置执行计数让它从干净状态重新开始
      if (t.enabled) {
        t.executed = 0;
        t.lastRun = millis();
        t.startTime = millis();
      }
    }

