Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
    // 7. 原样恢复逻辑规则状态
    for (size_t i = 0; i < LogicEngine::getList().size(); i++) {
      auto &r = LogicEngine::getList()[i];
      r.enabled = logicStates[i];
      // 如果原来是启用的，重置边沿检测从干净状态重新判断
      if (r.enabled) {
        r.prevCondition = false;
        r.lastTrigger = 0;
      }
    }

    // 8. RTC 定时任务不动（它们触发时间没到就不会执行，和引脚状态无关）

    // 9. 发布状态
    GpioControl::publishStatus();

    Serial.println("[GPIO] All cleared, tasks restored to original state");
  }


  else if (cmd == "dump") {
    JsonDocument doc;
    doc["type"] = "config_dump";
    doc["deviceId"] = getDeviceId();
    doc["deviceName"] = config.deviceName;

    // WiFi
    doc["staSsid"] = config.staSsid;
    doc["apHidden"] = config.apHidden;

    // MQTT
    doc["mqttHost"] = config.mqttHost;
    doc["mqttPort"] = config.mqttPort;
    doc["mqttUser"] = config.mqttUser;
    doc["mqttSsl"] = config.mqttSsl;
    doc["mqttStatus"] = MqttClient::isConnected() ? "connected" : "disconnected";

    // 订阅主题
    JsonArray subs = doc["subTopics"].to<JsonArray>();
    for (auto &t : config.subTopics) {
      JsonObject o = subs.add<JsonObject>();
      o["topic"] = t.topic;
      o["qos"] = t.qos;
    }

    // 发布主题
    JsonArray pubs = doc["pubTopics"].to<JsonArray>();
    for (auto &t : config.pubTopics) {
      JsonObject o = pubs.add<JsonObject>();
      o["topic"] = t.topic;
      o["qos"] = t.qos;
    }

    // 传感器
    JsonArray snrs = doc["sensors"].to<JsonArray>();
    for (auto &s : config.sensors) {
      JsonObject o = snrs.add<JsonObject>();
      o["pin"] = s.pin;
      o["interval"] = s.interval;
      o["type"] = s.type;
      o["enabled"] = s.enabled;
      o["label"] = s.label;
      o["persistent"] = s.persistent;
    }

    // 输入
    JsonArray ins = doc["inputs"].to<JsonArray>();
    for (auto &t : config.inputs) {
      JsonObject o = ins.add<JsonObject>();
      o["pin"] = t.pin;
      o["mode"] = t.mode;
      o["debounceMs"] = t.debounceMs;
      o["enabled"] = t.enabled;
      o["label"] = t.label;
      o["persistent"] = t.persistent;
    }

    // 定时器
    JsonArray tmrs = doc["timers"].to<JsonArray>();
    for (auto &te : config.timers) {
      JsonObject o = tmrs.add<JsonObject>();
      o["id"] = te.id;
      o["type"] = te.type;
      o["interval"] = te.interval;
      o["count"] = te.count;
      o["enabled"] = te.enabled;
      o["persistent"] = te.persistent;
      JsonDocument cmds;
      if (!deserializeJson(cmds, te.commandsJson)) {
        o["commands"] = cmds;
      }
    }

    // 逻辑规则
    JsonArray rules = doc["logicRules"].to<JsonArray>();
    for (auto &lr : config.logicRules) {
      JsonObject o = rules.add<JsonObject>();
      o["id"] = lr.id;
      o["operator"] = lr.operator_;
      o["enabled"] = lr.enabled;
      o["cooldown"] = lr.cooldown;
      o["persistent"] = lr.persistent;
      JsonArray conds = o["conditions"].to<JsonArray>();
      for (auto &c : lr.conditions) {
        JsonObject co = conds.add<JsonObject>();
        co["source"] = c.source;
        co["pin"] = c.pin;
        co["op"] = c.op;
        co["value"] = c.value;
      }
      JsonDocument acts;
      if (!deserializeJson(acts, lr.actionsJson)) {
        o["actions"] = acts;
      }
    }

    // I2C
    JsonArray i2cs = doc["i2cConfigs"].to<JsonArray>();
    for (auto &e : config.i2cConfigs) {
      JsonObject o = i2cs.add<JsonObject>();
      o["sda"] = e.sda;
      o["scl"] = e.scl;
      o["enabled"] = e.enabled;
    }

    // 1-Wire
    JsonArray ows = doc["owConfigs"].to<JsonArray>();
    for (auto &e : config.owConfigs) {
      JsonObject o = ows.add<JsonObject>();
      o["pin"] = e.pin;
      o["enabled"] = e.enabled;
    }

    // UART
    JsonArray uarts = doc["uartConfigs"].to<JsonArray>();
    for (auto &e : config.uartConfigs) {
      JsonObject o = uarts.add<JsonObject>();
      o["port"] = e.port;
      o["tx"] = e.txPin;
      o["rx"] = e.rxPin;
      o["baud"] = e.baud;
      o["dataBits"] = e.dataBits;
      o["stopBits"] = e.stopBits;
      o["parity"] = e.parity;
      o["enabled"] = e.enabled;
      o["listening"] = e.listening;
    }

    // SPI
    JsonArray spis = doc["spiConfigs"].to<JsonArray>();
    for (auto &e : config.spiConfigs) {
      JsonObject o = spis.add<JsonObject>();
      o["port"] = e.port;
      o["mosi"] = e.mosiPin;
      o["miso"] = e.misoPin;
      o["sclk"] = e.sclkPin;
      o["speed"] = e.speed;
      o["mode"] = e.mode;
      o["enabled"] = e.enabled;
    }

    // Touch
    JsonArray touches = doc["touchPins"].to<JsonArray>();
    for (auto &e : config.touchPins) {
      JsonObject o = touches.add<JsonObject>();
      o["pin"] = e.pin;
      o["threshold"] = e.threshold;
      o["debounceMs"] = e.debounceMs;
      o["enabled"] = e.enabled;
      o["label"] = e.label;
      o["persistent"] = e.persistent;
    }


    // 系统信息
    doc["batchInterval"] = config.batchInterval;
    doc["heapFree"] = ESP.getFreeHeap();
    doc["uptime"] = millis() / 1000;
    doc["firmware"] = FIRMWARE_VERSION;

    String payload;
    serializeJson(doc, payload);
    publishResult(payload);
    Serial.printf("[DUMP] Published full config (%d bytes)\n", payload.length());


  }


  else if (cmd == "status") {
    GpioControl::publishStatus();
  } else if (cmd == "restart") {
    Serial.println("[GPIO] Restarting...");
    delay(500);
    ESP.restart();
  } else if (cmd == "custom") {
    String action = doc["action"].as<String>();
    Serial.printf("[GPIO] Custom action: %s\n", action.c_str());
    if (action == "reset") {
      config.reset();
      Serial.println("[GPIO] Config reset, restarting...");
      delay(500);
      ESP.restart();
    } else if (action == "query_mqtt_ota_topic") {
      JsonDocument resp;
      resp["type"] = "mqtt_ota_topic";
      resp["deviceId"] = getDeviceId();
      resp["otaTopic"] = MQTT_OTA_TOPIC;
      resp["otaReportTopic"] = MQTT_OTA_REPORT_TOPIC;
      String p;
      serializeJson(resp, p);
      publishResult(p);

      Serial.printf("[MQTT-OTA] Reserved topic: %s, Report: %s\n",

                    MQTT_OTA_TOPIC, MQTT_OTA_REPORT_TOPIC);
    } else if (action == "query_pin_capabilities") {
      JsonDocument resp;
      resp["type"] = "pin_capabilities";
      resp["deviceId"] = getDeviceId();
      resp["supportsPwm"] = true;
      resp["supportsServo"] = true;
      resp["supportsAdc"] = true;
      resp["supportsTouch"] = true;
      resp["maxPwmValue"] = 255;
      resp["maxServoAngle"] = 180;
      resp["adcResolution"] = 4095;
      String p;
      serializeJson(resp, p);
      if (mqttClient.connected() && config.pubTopics.size() > 0) {
        publishResult(p);
      }
      Serial.println("[GPIO] Pin capabilities published");

    } else if (action == "query_batch_config") {
      JsonDocument resp;
      resp["type"] = "batch_config";
      resp["deviceId"] = getDeviceId();
      resp["batchInterval"] = config.batchInterval;
      String p;
      serializeJson(resp, p);
      if (mqttClient.connected() && config.pubTopics.size() > 0) {
        publishResult(p);
      }
      Serial.printf("[BATCH] Config: interval=%d\n", config.batchInterval);

    } else if (action == "set_batch_interval") {
      int interval = doc["interval"] | 0;
      config.batchInterval = interval;
      config.save();
      Serial.printf("[BATCH] Interval set to %d s\n", interval);
    }
  } else if (cmd == "sensor") {
    handleSensorCommand(doc);
  } else if (cmd == "input") {
    handleInputCommand(doc);
  } else if (cmd == "timer") {
    handleTimerCommand(doc);
  } else if (cmd == "logic") {
    handleLogicCommand(doc);
  } else if (cmd == "batch_status") {
    publishBatchStatus();
  } else if (cmd == "i2c") {
    I2C::handleCommand(doc);
  } else if (cmd == "onewire") {
    OneWire::handleCommand(doc);
  } else if (cmd == "uart") {
    UART::handleCommand(doc);
  } else if (cmd == "spi") {
    SPIBus::handleCommand(doc);
  } else if (cmd == "touch") {
    Touch::handleCommand(doc);
  } else if (cmd == "encoder") {  // ★ 新增
    Encoder::handleCommand(doc);
  }


  else if (cmd == "rtc") {
    RTC::handleCommand(doc);
  } else if (cmd == "rand") {
    Rand::handleCommand(doc);
  } else if (cmd == "script") {
    ScriptEngine::handleCommand(doc);
  } else if (cmd == "data") {
    DataEngine::handleCommand(doc);
  }



  else {
    Serial.printf("[GPIO] Unknown cmd: %s\n", cmd.c_str());
  }
  // ===== ACK 响应 =====
  if (doc.containsKey("_mid")) {
    String midStr = doc["_mid"].as<String>();
    if (midStr.length() > 0) {
      JsonDocument ack;
      ack["type"] = "ack";
      ack["_mid"] = midStr;
      ack["status"] = "ok";
      ack["deviceId"] = getDeviceId();
      String ackJson;
      serializeJson(ack, ackJson);
      if (mqttClient.connected() && config.pubTopics.size() > 0) {
        publishResult(ackJson);
      }
    }
  }
}

// 串口输入处理
static void checkSerialInput() {
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialBuffer.length() > 0) {
        Serial.printf("\n[SERIAL] Received: %s\n", serialBuffer.c_str());
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, serialBuffer);
        if (err) {
          Serial.printf("[SERIAL] JSON error: %s\n", err.c_str());
        } else {
          String cmd = doc["cmd"].as<String>();
          if (cmd == "sensor") {
            handleSensorCommand(doc);
          } else if (cmd == "input") {
            handleInputCommand(doc);
          } else if (cmd == "timer") {
            handleTimerCommand(doc);
          } else if (cmd == "logic") {
            handleLogicCommand(doc);
          } else {
            handleCommand(doc);
          }
        }
        serialBuffer = "";
      }
    } else {
      serialBuffer += c;
    }
  }
}

// MQTT OTA 处理
static void otaReset() {
  mqttOtaActive = false;
  otaInProgress = false;
  otaTotalSize = 0;
  otaChunks = 0;
  otaChunkCount = 0;
  otaWritten = 0;
}

static void otaReport(const String &status, int progress, uint32_t chunk = 0) {
  JsonDocument doc;
  doc["status"] = status;
  doc["progress"] = progress;
  doc["chunk"] = chunk;
  doc["written"] = otaWritten;
  doc["total"] = otaTotalSize;
  String json;
  serializeJson(doc, json);
  if (mqttClient.connected()) {
    mqttClient.publish(MQTT_OTA_REPORT_TOPIC, json.c_str());
  }
  Serial.printf("[MQTT-OTA] Report: %s %d%% (written=%u)\n",
                status.c_str(), progress, otaWritten);
}

static void handleOtaMessage(const uint8_t *payload, unsigned int length) {
  if (payload == nullptr || length == 0) return;

  Serial.printf("[MQTT-OTA] Received %u bytes\n", length);

  if (length > 5 && payload[0] == 0x01) {
    if (!mqttOtaActive) {
      Serial.println("[MQTT-OTA] Data without START - ignoring");
      return;
    }

