Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
    uint32_t chunkIndex = 0;
    memcpy(&chunkIndex, &payload[1], 4);

    const uint8_t *data = &payload[5];
    uint32_t dataLen = length - 5;

    otaLastChunk = millis();

    if (!Update.isRunning()) {
      Serial.println("[MQTT-OTA] Update not running!");
      otaReset();
      otaReport("error", 0, chunkIndex);
      return;
    }

    size_t written = Update.write(const_cast<uint8_t *>(data), dataLen);
    if (written != dataLen) {
      Serial.printf("[MQTT-OTA] Write FAIL chunk %u (wrote %u/%u)\n",
                    chunkIndex, written, dataLen);
      Update.printError(Serial);
      Update.abort();
      otaReset();
      otaReport("error", 0, chunkIndex);
      return;
    }

    otaWritten += dataLen;
    otaChunkCount = chunkIndex + 1;

    int progress = 0;
    if (otaTotalSize > 0) {
      progress = (int)((otaWritten * 100) / otaTotalSize);
      if (progress > 99) progress = 99;
    }

    if (chunkIndex % 64 == 0) {
      Serial.printf("[MQTT-OTA] Chunk %u, %u/%u bytes, %d%%\n",
                    chunkIndex, otaWritten, otaTotalSize, progress);
    }

    otaReport("receiving", progress, chunkIndex);
    return;
  }

  String cmd = "";
  cmd.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    cmd += (char)payload[i];
  }
  Serial.printf("[MQTT-OTA] Text cmd: %s\n", cmd.c_str());

  if (cmd.indexOf("START") >= 0) {
    Serial.println("[MQTT-OTA] START command received");

    if (otaInProgress || mqttOtaActive) {
      Serial.println("[MQTT-OTA] Cleaning stale OTA state");
      Update.abort();
      otaReset();
    }

    otaTotalSize = 0;
    otaChunks = 0;

    if (cmd.startsWith("{")) {
      JsonDocument doc;
      DeserializationError err = deserializeJson(doc, cmd);
      if (err) {
        Serial.printf("[MQTT-OTA] JSON parse error: %s\n", err.c_str());
        otaReport("error", 0);
        return;
      }

      otaTotalSize = doc["size"] | 0;
      otaChunks = doc["chunks"] | 0;

      const char *targetPtr = doc["target"];
      if (targetPtr && strlen(targetPtr) > 0) {
        String myId = getDeviceId();
        if (String(targetPtr) != myId) {
          Serial.printf("[MQTT-OTA] Not for me (target=%s, I am %s)\n",
                        targetPtr, myId.c_str());
          return;
        }
      }
    }

    Serial.printf("[MQTT-OTA] Size=%u, Chunks=%u, FreeHeap=%u\n",
                  otaTotalSize, otaChunks, ESP.getFreeHeap());

    bool beginOk = false;
    if (otaTotalSize > 0) {
      beginOk = Update.begin(otaTotalSize);
    } else {
      beginOk = Update.begin(UPDATE_SIZE_UNKNOWN);
    }

    if (beginOk) {
      otaInProgress = true;
      mqttOtaActive = true;
      otaWritten = 0;
      otaChunkCount = 0;
      otaLastChunk = millis();
      Serial.println("[MQTT-OTA] Update.begin OK");
      otaReport("started", 0);
    } else {
      Serial.println("[MQTT-OTA] Update.begin FAILED!");
      Update.printError(Serial);
    }
    return;
  }

  if (cmd == "DONE") {
    if (!mqttOtaActive) {
      Serial.println("[MQTT-OTA] DONE without START");
      return;
    }

    Serial.printf("[MQTT-OTA] Done, %u bytes, %u chunks\n",
                  otaWritten, otaChunkCount);
    otaReport("finalizing", 99);

    if (Update.end(true)) {
      Serial.println("[MQTT-OTA] SUCCESS - restarting");
      otaReport("success", 100);
      delay(1000);
      ESP.restart();
    } else {
      Serial.println("[MQTT-OTA] Update.end FAILED");
      Update.printError(Serial);
      otaReset();
      otaReport("error", 0);
    }
    return;
  }

  if (cmd == "ABORT") {
    Serial.println("[MQTT-OTA] Aborted");
    Update.abort();
    otaReset();
    otaReport("aborted", 0);
    return;
  }

  Serial.printf("[MQTT-OTA] Unknown command: %s\n", cmd.c_str());
}

// MQTT 消息回调
static void onMqttMessage(char *topic, byte *payload, unsigned int length) {
  String msg = "";
  for (unsigned int i = 0; i < length; i++) {
    msg += (char)payload[i];
  }
  Serial.printf("[MQTT] Data: %s = %s\n", topic, msg.c_str());

  if (!msg.startsWith("{")) return;

  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, msg);
  if (err) {
    Serial.printf("[MQTT] JSON error: %s\n", err.c_str());
    return;
  }

  if (doc.containsKey("_from")) {
    String from = doc["_from"].as<String>();
    if (from.length() > 0 && from == getDeviceId()) {
      Serial.printf("[MQTT] Echo filtered (from self) on %s\n", topic);
      return;
    }
  }

  String cmd = doc["cmd"].as<String>();
  if (cmd == "sensor") {
    handleSensorCommand(doc);
  } else if (cmd == "input") {
    handleInputCommand(doc);
  } else if (cmd == "timer") {
    handleTimerCommand(doc);
  } else if (cmd == "logic") {
    handleLogicCommand(doc);
  } else {
    handleCommand(doc, true);
  }
}

static void mqttCallback(char *topic, byte *payload, unsigned int length) {
  Serial.printf("[MQTT] Msg: %s (%u bytes)\n", topic, length);

  if (strcmp(topic, MQTT_OTA_TOPIC) == 0) {
    handleOtaMessage((const uint8_t *)payload, length);
    return;
  }

  onMqttMessage(topic, payload, length);
}

// MqttClient 命名空间
namespace MqttClient {

void init() {
  connected = false;
  mqttOtaActive = false;
  otaInProgress = false;
  otaWritten = 0;
  otaTotalSize = 0;
  lastBatchReport = millis();
  mqttState = MQTT_IDLE;
  mqttStateTime = millis();
  mqttReconnectBackoff = 2000;
}

void loop() {

  // MQTT 开关：关闭时不处理任何 MQTT 逻辑
  if (!config.mqttEnabled) {
    if (connected) {
      mqttClient.disconnect();
      connected = false;
      mqttState = MQTT_IDLE;
      Serial.println("[MQTT] Disabled by config");
    }
    return;
  }
  // MQTT 未连接时，允许串口命令
  if (!mqttClient.connected()) {
    checkSerialInput();
  }

  if (!WiFi.isConnected()) {
    if (connected) {
      Serial.println("[MQTT] No WiFi");
      connected = false;
      mqttState = MQTT_IDLE;
      mqttStateTime = millis();
      mqttReconnectBackoff = 2000;
      sslPreConnected = false;
    }
    return;
  }

  // 已连接：正常处理
  if (mqttState == MQTT_LINKED && mqttClient.connected()) {
    mqttClient.loop();

    // MQTT OTA 超时检测
    if (mqttOtaActive && millis() - otaLastChunk > 30000) {
      Serial.println("[MQTT-OTA] Timeout - aborting");
      Update.abort();
      otaReset();
      otaReport("timeout", 0);
    }

    // 批量状态上报
    if (config.batchInterval > 0) {
      unsigned long intervalMs = (unsigned long)config.batchInterval * 1000;
      if (millis() - lastBatchReport >= intervalMs) {
        lastBatchReport = millis();
        publishBatchStatus();
      }
    }

    // 检测连接断开
    if (!mqttClient.connected()) {
      Serial.println("[MQTT] Connection lost");
      connected = false;
      mqttState = MQTT_IDLE;
      mqttStateTime = millis();
      mqttReconnectBackoff = 2000;
      sslPreConnected = false;
    }
    return;
  }

  // 未连接：非阻塞重连状态机
  connected = false;
  unsigned long now = millis();

  switch (mqttState) {

