Fengzi-0o0/esp32-smart-gateway/mqtt_client.cpp
    case MQTT_IDLE:
      {
        if (now - mqttStateTime < mqttReconnectBackoff) return;

        if (config.mqttHost.length() == 0) {
          mqttStateTime = now;
          mqttReconnectBackoff = MQTT_MAX_BACKOFF;
          Serial.println("[MQTT] No host configured, waiting...");
          return;
        }

        pendingClientId = config.mqttClientId.length() > 0
                            ? config.mqttClientId
                            : getDeviceId();

        if (config.mqttSsl) {
          sslClient.setInsecure();
          mqttClient.setClient(sslClient);
        } else {
          mqttClient.setClient(wifiClient);
        }
        mqttClient.setCallback(mqttCallback);
        mqttClient.setBufferSize(4096);
        sslPreConnected = false;


        Serial.printf("[MQTT] Resolving %s ...\n", config.mqttHost.c_str());
        mqttState = MQTT_RESOLVING;
        mqttStateTime = now;
        break;
      }

    case MQTT_RESOLVING:
      {
        if (now - mqttStateTime > 5000) {
          Serial.println("[MQTT] DNS timeout");
          mqttState = MQTT_IDLE;
          mqttStateTime = now;
          mqttReconnectBackoff = min(mqttReconnectBackoff * 2, MQTT_MAX_BACKOFF);
          Serial.printf("[MQTT] Backoff: %lu ms\n", mqttReconnectBackoff);
          return;
        }

        int ret = WiFi.hostByName(config.mqttHost.c_str(), resolvedIP);

        if (ret == 0 || (resolvedIP[0] == 0 && resolvedIP[1] == 0 && resolvedIP[2] == 0 && resolvedIP[3] == 0)) {
          Serial.println("[MQTT] DNS failed");
          mqttState = MQTT_IDLE;
          mqttStateTime = now;
          mqttReconnectBackoff = min(mqttReconnectBackoff * 2, MQTT_MAX_BACKOFF);
          Serial.printf("[MQTT] Backoff: %lu ms\n", mqttReconnectBackoff);
          return;
        }

        Serial.printf("[MQTT] Resolved to %s\n", resolvedIP.toString().c_str());

        mqttClient.setServer(resolvedIP, config.mqttPort);
        mqttState = MQTT_CONNECTING;
        mqttStateTime = now;
        break;
      }

    case MQTT_CONNECTING:
      {
        if (now - mqttStateTime > 10000) {
          Serial.println("[MQTT] Connect timeout");
          int rc = mqttClient.state();
          Serial.printf("[MQTT] rc=%d (%s)\n", rc, mqttErrorString(rc));
          mqttClient.disconnect();
          sslPreConnected = false;
          mqttState = MQTT_IDLE;
          mqttStateTime = now;
          mqttReconnectBackoff = min(mqttReconnectBackoff * 2, MQTT_MAX_BACKOFF);
          Serial.printf("[MQTT] Backoff: %lu ms\n", mqttReconnectBackoff);
          return;
        }

        // SSL: 先用域名建立连接（带 SNI），再让 PubSubClient 走 MQTT
        if (config.mqttSsl && !sslPreConnected) {
          Serial.printf("[MQTT-SSL] Connecting to %s:%u ...\n",
                        config.mqttHost.c_str(), config.mqttPort);
          sslClient.stop();
          delay(50);
          sslClient.setInsecure();
          if (!sslClient.connect(config.mqttHost.c_str(), config.mqttPort, 10000)) {
            Serial.println("[MQTT-SSL] SSL connect failed");
            mqttClient.disconnect();
            sslPreConnected = false;
            mqttState = MQTT_IDLE;
            mqttStateTime = now;
            mqttReconnectBackoff = min(mqttReconnectBackoff * 2, MQTT_MAX_BACKOFF);
            Serial.printf("[MQTT] Backoff: %lu ms\n", mqttReconnectBackoff);
            return;
          }
          Serial.println("[MQTT-SSL] SSL connected OK");
          sslPreConnected = true;
        }

        // PubSubClient 检测到 socket 已连接，直接发 MQTT CONNECT
        Serial.printf("[MQTT] %s %s:%u (ClientID=%s)\n",
                      config.mqttSsl ? "SSL" : "TCP",
                      config.mqttHost.c_str(),
                      config.mqttPort,
                      pendingClientId.c_str());
        Serial.printf("[MQTT] Free heap: %u bytes\n", ESP.getFreeHeap());

        bool ok = false;
        if (config.mqttUser.length() > 0) {
          Serial.printf("[MQTT] Auth: user=%s\n", config.mqttUser.c_str());
          ok = mqttClient.connect(
            pendingClientId.c_str(),
            config.mqttUser.c_str(),
            config.mqttPass.c_str(),
            LWT_TOPIC,   // 遗嘱主题
            1,           // QoS
            true,        // retain
            LWT_OFFLINE  // 遗嘱消息
          );

        } else {
          Serial.println("[MQTT] Auth: none");
          ok = mqttClient.connect(
            pendingClientId.c_str(),
            NULL, NULL,
            LWT_TOPIC,   // 遗嘱主题
            1,           // QoS
            true,        // retain
            LWT_OFFLINE  // 遗嘱消息
          );
        }

        if (ok) {
          Serial.println("[MQTT] Connected!");
          connected = true;
          mqttState = MQTT_LINKED;
          mqttReconnectBackoff = 2000;

          for (auto &t : config.subTopics) {
            mqttClient.subscribe(t.topic.c_str(), t.qos);
            Serial.printf("[MQTT] Sub: %s QoS%d\n", t.topic.c_str(), t.qos);
          }
          mqttClient.subscribe(MQTT_OTA_TOPIC, 1);
          Serial.printf("[MQTT] Sub: %s QoS1 (Reserved OTA)\n", MQTT_OTA_TOPIC);

          lastBatchReport = millis();
        } else {
          int rc = mqttClient.state();
          Serial.printf("[MQTT] Connect failed rc=%d (%s)\n", rc, mqttErrorString(rc));
          Serial.printf("[MQTT] Free heap: %u bytes\n", ESP.getFreeHeap());
          Serial.printf("[MQTT] WiFi RSSI: %d dBm\n", WiFi.RSSI());

          mqttClient.disconnect();
          sslPreConnected = false;
          mqttState = MQTT_IDLE;
          mqttStateTime = now;
          mqttReconnectBackoff = min(mqttReconnectBackoff * 2, MQTT_MAX_BACKOFF);
          Serial.printf("[MQTT] Backoff: %lu ms\n", mqttReconnectBackoff);
        }
        break;
      }


    default:
      mqttState = MQTT_IDLE;
      mqttStateTime = now;
      break;
  }
}


bool isConnected() {
  return mqttClient.connected();
}

void disconnect() {
  if (mqttClient.connected()) {
    mqttClient.disconnect();
  }
  connected = false;
  mqttState = MQTT_IDLE;
  mqttStateTime = millis();
  mqttReconnectBackoff = 2000;
  Serial.println("[MQTT] Disconnected");
}

void publish(const char *topic, const char *payload) {
  if (mqttClient.connected()) {
    mqttClient.publish(topic, payload);
  }
  if (_wsClient != 0xFF && _wsSend && config.pubTopics.size() > 0
      && String(topic) == config.pubTopics[0].topic) {
    _wsSend(_wsClient, payload);
  }
}

void publish(const char *topic, const uint8_t *payload, unsigned int length) {
  if (mqttClient.connected()) {
    mqttClient.publish(topic, payload, length);
  }
}

bool publish(const String &topic, const String &payload, uint8_t qos) {
  if (mqttClient.connected()) {
    mqttClient.publish(topic.c_str(), payload.c_str());
  }
  if (_wsClient != 0xFF && _wsSend && config.pubTopics.size() > 0
      && topic == config.pubTopics[0].topic) {
    _wsSend(_wsClient, payload.c_str());
  }
  return mqttClient.connected();
}


}  // namespace MqttClient
